In [1]:
import pandas as pd
import numpy as np

In [11]:
df = pd.DataFrame({
     'key1' : ['a', 'a', 'b', 'b', 'a'],
     'key2' : ['one', 'two', 'one', 'two', 'one'],
     'data1' : np.random.randn(5),
     'data2' : np.random.randn(5)
    })
df

  key1 key2     data1     data2
0    a  one  0.176502  0.020411
1    a  two  1.308977 -1.904087
2    b  one -0.487516  0.240428
3    b  two -0.118598  1.380646
4    a  one -2.275657 -1.110236

In [12]:
grouped = df['data1'].groupby(df['key1'])
grouped # key1열을 데이터그룹화를 한 다음,  data1열의 통계량을 계산할 준비를 한다.

In [13]:
grouped.mean()

key1
a   -0.263393
b   -0.303057
Name: data1, dtype: float64

In [16]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()
means

key1  key2
a     one    -1.049577
      two     1.308977
b     one    -0.487516
      two    -0.118598
Name: data1, dtype: float64

In [17]:
means.unstack() #unstactk()함수를 적용해서 최하위 인덱스를 칼럼으로 올린 뒤, 데이터를 분석

key2       one       two
key1
a    -1.049577  1.308977
b    -0.487516 -0.118598

In [19]:
# dataframe을 groupby 화 하기
df.groupby('key1').mean()

         data1     data2
key1
a    -0.263393 -0.997971
b    -0.303057  0.810537

In [21]:
df.groupby('key1').count()

      key2  data1  data2
key1
a        3      3      3
b        2      2      2

In [23]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one  -1.049577 -0.544912
     two   1.308977 -1.904087
b    one  -0.487516  0.240428
     two  -0.118598  1.380646

In [24]:
df.groupby(['key1', 'key2'])['data2'].mean() #data2만 뽑기

key1  key2
a     one    -0.544912
      two    -1.904087
b     one     0.240428
      two     1.380646
Name: data2, dtype: float64

In [30]:
for name, group in df.groupby('key1'):
    print(name, group)

a   key1 key2     data1     data2
0    a  one  0.176502  0.020411
1    a  two  1.308977 -1.904087
4    a  one -2.275657 -1.110236
b   key1 key2     data1     data2
2    b  one -0.487516  0.240428
3    b  two -0.118598  1.380646

In [37]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1,k2,group)

a one   key1 key2     data1     data2
0    a  one  0.176502  0.020411
4    a  one -2.275657 -1.110236
a two   key1 key2     data1     data2
1    a  two  1.308977 -1.904087
b one   key1 key2     data1     data2
2    b  one -0.487516  0.240428
b two   key1 key2     data1     data2
3    b  two -0.118598  1.380646

In [39]:
pieces = dict(list(df.groupby('key1'))) # dict 형태로
pieces

{'a':   key1 key2     data1     data2
 0    a  one  0.176502  0.020411
 1    a  two  1.308977 -1.904087
 4    a  one -2.275657 -1.110236, 'b':   key1 key2     data1     data2
 2    b  one -0.487516  0.240428
 3    b  two -0.118598  1.380646}

In [42]:
pieces['b']

  key1 key2     data1     data2
2    b  one -0.487516  0.240428
3    b  two -0.118598  1.380646

In [44]:
df2 = pd.DataFrame(np.random.randn(5,5),
                  columns = ['a', 'b', 'c', 'd', 'e'],
                  index = ['Joe', 'Steve', 'Wes', 'Jim', 'Travis'])
df2

               a         b         c         d         e
Joe     0.449040  1.214939 -1.403692  0.049928  0.312633
Steve   1.452827 -1.532417  1.853718 -0.381309  0.277516
Wes    -0.052313  1.731657  0.838659 -0.525834 -0.209720
Jim     1.887655 -0.329298 -0.221055 -2.737351 -0.325140
Travis -1.383486 -1.316888 -0.210758  0.994811 -0.534020

In [46]:
map_dict = {
    'a' : 'red',
    'b' : 'red',
    'c' : 'blue',
    'd' : 'blue',
    'e' : 'red',
    'f' : 'orange'
}
map_dict

{'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f': 'orange'}

In [48]:
dict(list(df2.groupby(map_dict, axis=1)))

{'blue':                c         d
 Joe    -1.403692  0.049928
 Steve   1.853718 -0.381309
 Wes     0.838659 -0.525834
 Jim    -0.221055 -2.737351
 Travis -0.210758  0.994811, 'red':                a         b         e
 Joe     0.449040  1.214939  0.312633
 Steve   1.452827 -1.532417  0.277516
 Wes    -0.052313  1.731657 -0.209720
 Jim     1.887655 -0.329298 -0.325140
 Travis -1.383486 -1.316888 -0.534020}

In [50]:
df2.groupby(map_dict,axis=1).sum()

            blue       red
Joe    -1.353764  1.976612
Steve   1.472408  0.197926
Wes     0.312825  1.469624
Jim    -2.958406  1.233218
Travis  0.784053 -3.234394

In [52]:
map_s = pd.Series(map_dict)
map_s

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [54]:
df2.groupby(map_s, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        2    3
Jim        2    3
Travis     2    3

In [56]:
grouped = df.groupby('key1')
grouped

def peak_to_peak(arr):
    return arr.max() - arr.min()

grouped.agg(peak_to_peak)

         data1     data2
key1
a     3.584633  1.924498
b     0.368917  1.140218

In [59]:
grouped.agg("std")

         data1     data2
key1
a     1.832356  0.967149
b     0.260864  0.806256

In [61]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0 -0.263393  1.832356 -2.275657 -1.049577  0.176502  0.742739
b      2.0 -0.303057  0.260864 -0.487516 -0.395286 -0.303057 -0.210828

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.308977   3.0 -0.997971  0.967149 -1.904087 -1.507162 -1.110236
b    -0.118598   2.0  0.810537  0.806256  0.240428  0.525483  0.810537


           75%       max
key1
a    -0.544912  0.020411
b     1.095592  1.380646

# refered by https://nittaku.tistory.com/131